[
  {
    "testimonial_text": "As engineers, my wife and I thought we could handle our son's applications, but we were stuck on how to make his passion for building model rockets seem 'intellectual.' Dr. Gonzales showed him how to connect the physics of propulsion to his academic curiosity, which became the theme of his application. Through the process, we watched his confidence grow—he took ownership of his essays and even presented his project at a local STEM fair. That focus and maturity are what we believe secured his full-tuition scholarship to USC.",
    "source": "Wei Chen",
    "type": "parent",
    "fname": "Wei",
    "lname": "Chen",
    "high_school": "Harvard-Westlake School",
    "college": "University of Southern California",
    "imgSrc": "/images/testimonials_images/1_jxmp3yx19xbgt27p928n.png"
  },
  {
    "testimonial_text": "Our daughter lives for choir, but her first essay read like a resume. The counselor asked her, ‘What happened the night two soloists dropped out?’ That became the story—how she rearranged parts backstage and kept 30 voices in tune under pressure. The drafts went from 850 words to 620 with concrete details about leadership and harmony. She was admitted to Stanford and the acceptance email felt earned because the application finally sounded like her.",
    "source": "Yan Li",
    "type": "parent",
    "fname": "Yan",
    "lname": "Li",
    "high_school": "Lynbrook High School",
    "college": "Stanford",
    "imgSrc": "/images/testimonials_images/2_k2n2408xll1wla3di4h5.png"
  },
  {
    "testimonial_text": "Our son is brilliant but prone to procrastination. The weekly check-in calls from his counselor became a structured anchor that kept him on track. They taught him how to break down his most ambitious idea—a self-directed data science project analyzing local traffic patterns—into bi-weekly milestones. That completed project became the centerpiece of his application, and the planning skills he learned gave him the confidence to articulate it brilliantly in his interviews. He didn't just get into UC Berkeley; he arrived there already knowing how to tackle big challenges.",
    "source": "Kenji Tanaka",
    "type": "parent",
    "fname": "Kenji",
    "lname": "Tanaka",
    "high_school": "Mission San Jose High School",
    "college": "UC Berkeley",
    "imgSrc": "/images/testimonials_images/3_dszly3naf62j5gpfgw89.png"
  },
  {
    "testimonial_text": "Managing college applications for our twin boys—one passionate about bio, the other obsessed with robotics—was daunting. Ivy Ready built separate, color-coded timelines for each of them and even helped us navigate their playful sibling rivalry over attention. It brought calm and structure to what could have been chaos. Both boys found their perfect-fit schools, and for the first time that year, our family could finally breathe easy.",
    "source": "Oleg Ivanov",
    "type": "parent",
    "fname": "Oleg",
    "lname": "Ivanov",
    "high_school": "Saratoga High School",
    "college": "Harvard University",
    "imgSrc": "/images/testimonials_images/4_rllbq6uiewuxqyq4egcg.png"
  },
  {
    "testimonial_text": "I come from a family of scientists, and I felt pressured to write a 'STEM' essay. My mentor pushed me to write about the summer I spent teaching my grandmother to use a smartphone instead, highlighting the patience and communication it required. That essay became a central part of my Columbia interview; my interviewer said it gave her a clear sense of my character beyond my grades. I'm convinced that unique perspective is what made the difference.",
    "source": "Mariya Petrova",
    "type": "student",
    "fname": "Mariya",
    "lname": "Petrova",
    "high_school": "Bellarmine College Prep",
    "college": "Columbia University",
    "imgSrc": "/images/testimonials_images/5_h84bw69qyndbstz9hk7g.png"
  },
  {
    "testimonial_text": "Our daughter was juggling AP classes, rehearsals, and college essays—it was a lot. The Ivy Ready team set up Sunday check-ins and a shared Google Doc with small, achievable goals like drafting intros or polishing activity bullets. The mock interview training was transformative; she learned to pause, breathe, and express her ideas confidently. When her Northwestern acceptance came in, she said she felt prepared, not lucky—and that’s what made us proud.",
    "source": "Carlos Garcia",
    "type": "parent",
    "fname": "Carlos",
    "lname": "Garcia",
    "high_school": "Mission San Jose High School",
    "college": "Northwestern University",
    "imgSrc": "/images/testimonials_images/6_6chki80beaet665v1cwc.png"
  },
  {
    "testimonial_text": "I was determined to write about my international background, but my first draft was just a timeline of my life. My essay mentor told me, 'Show me one suitcase. Tell me what's in it and why.' That single piece of advice transformed my essay into a story about the books and recipes I carry to stay connected to home, which felt truly unique to me.",
    "source": "Amina Al-Mansoori",
    "type": "student",
    "fname": "Amina",
    "lname": "Al-Mansoori",
    "high_school": "The Harker School",
    "college": "Princeton University",
    "imgSrc": "/images/testimonials_images/7_r9px395p6qblj5488tzu.png"
  },
  {
    "testimonial_text": "Our son’s early application didn’t go the way he hoped—he was deferred and discouraged. His counselor stepped in immediately, helping him refocus with a clear action plan: write an update letter, strengthen his engineering portfolio, and add two well-matched target schools. That structure restored his confidence. When Cornell Engineering came through, the victory felt not just earned but deserved.",
    "source": "Nebil Yilmaz",
    "type": "parent",
    "fname": "Nebil",
    "lname": "Yilmaz",
    "high_school": "Archbishop Mitty High School",
    "college": "Cornell University",
    "imgSrc": "/images/testimonials_images/8_5a26pcycs6nfkb2cxp49.png"
  },
  {
    "testimonial_text": "My mentor's best advice was, 'Don't try to sound like a Nobel laureate, sound like a curious 18-year-old.' She had me rewrite my 'Why MIT?' essay from a dry analysis of their research to a story about the 3D printer I rigged from old parts and how I wanted access to their 'maker' culture. I think they appreciated the honesty.",
    "source": "Priya Patel",
    "type": "student",
    "fname": "Priya",
    "lname": "Patel",
    "high_school": "Palo Alto High School",
    "college": "MIT",
    "imgSrc": "/images/testimonials_images/9_jxmp3yx19xbgt27p928n.png"
  },
  {
    "testimonial_text": "We were battling senior-year procrastination, and it was starting to wear everyone down. Our counselor introduced 'Saturday sprints'—short, focused writing sessions that turned dread into progress. It created momentum and accountability without pressure. When USC and another strong offer came in, we compared programs calmly and made a confident, happy choice as a family.",
    "source": "Anika Sharma",
    "type": "parent",
    "fname": "Anika",
    "lname": "Sharma",
    "high_school": "Harvard-Westlake School",
    "college": "University of Southern California",
    "imgSrc": "/images/testimonials_images/10_ga75sqqyx0z2rz4e4vmk.png"
  },
  {
    "testimonial_text": "I thought I had to write about a huge, life-changing event. My counselor helped me see the value in a smaller story. I ended up writing about working in my parents' pho restaurant and how I learned to 'taste' balance in the broth. It was a metaphor for finding my own balance between Vietnamese and American culture, and it felt so much more true to who I am.",
    "source": "Linh Pham",
    "type": "student",
    "fname": "Linh",
    "lname": "Pham",
    "high_school": "Los Altos High School",
    "college": "Duke University",
    "imgSrc": "/images/testimonials_images/11_1l27tp2vhs24n5joxldr.png"
  }
]
