[
  {
    "testimonial_text": "Working with Dr. Raymond Gonzales was the best decision we made for our son, David. Raymond not only guided him through every step of the college process but also inspired him to find his voice and confidence. With Raymond’s mentorship, David started a neuroscience club at his school, completed a Stanford summer program, and earned admission to USC with a full-tuition scholarship. We can’t thank him enough for making this once-overwhelming process feel empowering and joyful.",
    "source": "Maria Reynolds",
    "type": "parent",
    "fname": "Maria",
    "lname": "Reynolds",
    "high_school": "Harvard-Westlake School",
    "college": "University of Southern California",
    "imgSrc": "/images/testimonial/maria.png"
  },
  {
    "testimonial_text": "I came to Ivy Ready completely unsure of what I wanted to study, and my counselor helped me discover my passion for data science. Her essay feedback pushed me to be genuine and reflective rather than just impressive. Thanks to her, I was admitted to UC Berkeley and UCLA, and I actually enjoyed the application process by the end!",
    "source": "Samantha Wu",
    "type": "student",
    "fname": "Samantha",
    "lname": "Wu",
    "high_school": "Mission San Jose High School",
    "college": "UC Berkeley",
    "imgSrc": "/images/testimonial/samantha.png"
  },
  {
    "testimonial_text": "Our daughter was guided through every part of the college process with care and precision. Her counselor helped her turn her love of music into a standout narrative that resonated through her essays. She was accepted to NYU’s Tisch School of the Arts, her dream program! Ivy Ready’s personalized approach truly made a difference.",
    "source": "Julie Tran",
    "type": "parent",
    "fname": "Julie",
    "lname": "Tran",
    "high_school": "Lynbrook High School",
    "college": "NYU Tisch",
    "imgSrc": "/images/testimonial/emma.png"
  },
  {
    "testimonial_text": "I worked on my Common App essays and interview prep and learned to tell stories that truly reflected who I am. The encouragement and feedback gave me confidence I didn’t know I had. With this guidance, I was accepted into Columbia University through Early Decision!",
    "source": "Ethan Morales",
    "type": "student",
    "fname": "Ethan",
    "lname": "Morales",
    "high_school": "Bellarmine College Prep",
    "college": "Columbia University",
    "imgSrc": "/images/testimonial/ethan.png"
  },
  {
    "testimonial_text": "Our twin sons were guided through one of the most stressful experiences for parents—college applications. They stayed on schedule, motivated, and even laughing through the process. Both boys earned merit scholarships and acceptance to their top-choice schools. Ivy Ready truly delivered results beyond our expectations.",
    "source": "Laura Kim",
    "type": "parent",
    "fname": "Laura",
    "lname": "Kim",
    "high_school": "Saratoga High School",
    "college": "UC San Diego & Purdue University",
    "imgSrc": "/images/testimonial/laura.png"
  },
  {
    "testimonial_text": "I had the privilege of working with a wonderful essay mentor who was patient, supportive, and incredibly insightful. She helped me refine my personal statement until it perfectly captured my story. With her help, I was admitted to Princeton! I couldn’t have done it without her encouragement and honest feedback.",
    "source": "Michael Chang",
    "type": "student",
    "fname": "Michael",
    "lname": "Chang",
    "high_school": "The Harker School",
    "college": "Princeton University",
    "imgSrc": "/images/testimonial/michael.png"
  },
  {
    "testimonial_text": "We are so grateful to the Ivy Ready team. Our daughter was juggling AP courses, sports, and volunteer work, but her counselor kept her organized and calm. The essay guidance and mock interviews were exceptional. She was accepted to Northwestern University, and we’re thrilled!",
    "source": "Karen Liu",
    "type": "parent",
    "fname": "Karen",
    "lname": "Liu",
    "high_school": "Mission San Jose High School",
    "college": "Northwestern University",
    "imgSrc": "/images/testimonial/karen.png"
  },
  {
    "testimonial_text": "My essays truly came to life thanks to my mentor. She knew exactly how to bring out my authentic personality without making it sound forced. She even helped me prepare for my Caltech interview. I ended up being accepted to both Caltech and MIT! Thank you, Ivy Ready.",
    "source": "Jason Lin",
    "type": "student",
    "fname": "Jason",
    "lname": "Lin",
    "high_school": "Palo Alto High School",
    "college": "MIT",
    "imgSrc": "/images/testimonial/jason.png"
  },
  {
    "testimonial_text": "Our son was kept focused, optimistic, and disciplined throughout his senior year. We loved how Ivy Ready’s structure helped our family stay on track. He got into Cornell’s School of Engineering, and we couldn’t be prouder.",
    "source": "Robert Martinez",
    "type": "parent",
    "fname": "Robert",
    "lname": "Martinez",
    "high_school": "Archbishop Mitty High School",
    "college": "Cornell University",
    "imgSrc": "/images/testimonial/robert.png"
  },
  {
    "testimonial_text": "I learned so much about how to tell my story through essays. The guidance I received helped me build confidence in my writing and feel proud of my journey. I’m now attending Duke University on a partial scholarship—thank you, Ivy Ready!",
    "source": "Isabella Reyes",
    "type": "student",
    "fname": "Isabella",
    "lname": "Reyes",
    "high_school": "Los Altos High School",
    "college": "Duke University",
    "imgSrc": "/images/testimonial/isabella.png"
  }
]